{
	"meta": {
		"title": "Inside Sales",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email"
	},
	"facebook": {
		"title": "Inside Sales",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email",
		"imageUrl": "http://www.vgulp.com/hustlers1.jpg",
		"pageUrl": "http://www.vgulp.com/careers/inside-sales.html"
	},
	"module": {
		"name": "careers/inside-sales",
		"slug": "careers/inside-sales.html"
	},
	"template": "www/js/app/careers/views/careersPage.html",
	"showAgeGate": "false",
	"numberOfOpenPositions": "2",
	"location": "Bangalore",
	"introductionHtml": "                    <p class=\"lead\">Inside sales representatives of Vgulp are target oriented, Have an eye for detail, are opportunistic, could sell ice to an eskimo over a call.\r\n                    </p>  <br>\r\n                    <p>We were launched in June 2013, and received funding in August. We are addressing a no brainer idea in a 35 Bn USD market in India, that had little takers for. Vgulp solves a simple problem - helping drinkers (like us, you?) find the best deals and discounts in the most happening joints in town. Through this we improve walk-ins and help merchants meet their business objectives.</p>\r\n                    <br>\r\n                    <p>Being in the inside sales team for Vgulp, you are expected to identify opportunities, within a wide range - EPL screenings, to parties, to events, to the happening joints, and build relationship with these merchants in an objective to negotiate awesome deals for our subscriber base. upbe a hustler. Unlike our competitors who sell anything from nail polish to spa to auto parts and car wash, we do receive a warm welcome because of our value proposition that we have built along the way, hence we have seen above industry standard conversion rates.</p>\r\n                    <br>\r\n                    <p>While we are not particular about you having a degree / years into your resume, or you have been in BPOs, we are particular about your knowledge in the online / digital and social advertising space and how they can influence consumer decisions. Specifically if you are in a BPO and wish to apply, you are welcome.</p>\r\n                    <p>** In the case you have no prior experience, you will start your stint at Vgulp as an Intern / Trainee for a period of 3 months.**</p>\r\n",
	"skills": {
		"title": "What is expected of you",
		"descriptionHtml": "<ul>\r\n                        <li>Be opportunistic, identify and prospect an ideal merchant for high outcomes with regards to their walk-in objectives</li>\r\n                        <li>Explain the conceptual importance to the staff on the floor, while managing objective driven conversation to the business owners</li>\r\n                        <li>Increase revenues, by helping the Sales identify target accounts and passing on opportunities</li>\r\n                        <li>Work with the marketing / customer success team to identify opportunities to upsell / cross sell</li>\r\n                        <li>Maintain a highly sorted database, and execute campaigns / promotions from time to time</li>\r\n                    </ul>\r\n"
	},
	"otherPositions": [
		"<a href=\"./sales-manager.html\">Sales Manager</a> ",
		"                     <a href=\"./marketing.html\">Marketing</a>"
	],
	"weLoveYouIf": {
		"title": "What you should be",
		"descriptionHtml": "<ul class=\"bulleted\">\r\n                    <li>Proven selling skills - performance oriented in a competitive environment</li>\r\n                    <li>Experience having selling / goal oriented conversations over the phone</li>\r\n                    <li>Ability to take responsibility, and benchmark own performance to improve the metrics from time to time</li>\r\n                </ul>\r\n<br>\r\n<h2>Benefits</h2>\r\n<ul>\r\n                    <li>Competitive Salary and incentives</li>\r\n                    <li>Work from home</li>\r\n                    <li>Flexible work hours</li>\r\n                    <li>Stock Options</li>\r\n                    <li>Challenging career and growth</li>\r\n                    <li>irresistible leaves and holidays</li>\r\n                    <li>Company sponsored booze on Fridays</li>\r\n                    <li>Unlimited fun</li>\r\n                    <li>Need anything more?</li>\r\n                </ul>"
	},
	"images": [],
	"created_at": "2013-11-14T06:52:02.255Z",
	"updated_at": "2013-11-14T06:52:02.255Z",
	"_id": "528473128580595205000006"
}