{
	"meta": {
		"title": "Web graphic designer",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email"
	},
	"facebook": {
		"title": "Web graphic designer",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email",
		"imageUrl": "http://www.vgulp.com/careers/ninja-designer.jpg",
		"pageUrl": "http://www.vgulp.com/careers/web-graphic-designer.html"
	},
	"module": {
		"name": "careers/web-graphic-designer",
		"slug": "careers/web-graphic-designer.html"
	},
	"template": "www/js/app/careers/views/careersPage.html",
	"showAgeGate": "false",
	"numberOfOpenPositions": "1",
	"location": "Bangalore",
	"introductionHtml": "                    <p>We were launched in June 2013, and received funding in August. We are addressing a no brainer idea in a 35 Bn USD market in India, that had little takers for. Vgulp solves a simple problem - helping drinkers (like us, you?) find the best deals and discounts in the most happening joints in town. Through this we improve walk-ins and help merchants meet their business objectives.</p>\r\n                    <br>\r\n                    <p>Being a Graphic Designer for Vgulp, you would be the man behind our creatives for deals, our website , our mobile applications , our web application and those slick images for deals and the rest. You shall swear by responsive design and CSS frameworks that help you achieve the same. You will bring with you powder and puff to make the vgulp lady look good! If you are short of imagination, we will fill you in !</p>\r\n                    <br>\r\n                    <p>While we are not particular about you having a degree / years into your resume, we are people passionate about technology and believe in early adoptions. This has many a times honestly drove us against the wall, but heck we have come back stronger and more convinced. We believe in technology and programming being fun and \"delivery\" a necessary side effect. So all you hackers, philosophers, dreamers if you wanna risk something for the love of \"what you believed in\", Vgulp is calling!</p>\r\n",
	"skills": {
		"title": "What we think you should have",
		"descriptionHtml": "<ul>\r\n                        <li>Worked for at-least 2 years and above as a web designer. If no prove it with a showcase on the web that you have the skills</li>\r\n                        <li>Should have An online portfolio of work to demonstrate his or her experience </li>\r\n                        <li>We design our mockups with Balsamiq. It will help if you know the tool</li>\r\n                        <li>Any or many of Photoshop, Illustrator, Fireworks, Visio,Dreamweaver</li>\r\n                        <li>Responsive design is your vada pav which you have for lunch, breakfast and dinner.</li>\r\n                        <li>When you are not in a pub or bar you should probably be high on HTML5 or CSS3</li>\r\n                        <li>Modernizer, Bootstrap, Foundation, topcoat, Flat-UI keep you interested in life</li>\r\n                        <li>You can prototype HTML, Javascript, CSS. Should we really say this after all that?</li>\r\n                        <li>Familiarity with the technical considerations needed when designing for the web</li>\r\n                    </ul>"
	},
	"otherPositions": [
		"<a href=\"./javascript-ninja.html\">Javascript Ninja</a>",
		"<a href=\"./web-developer.html\">Web Developer</a>"
	],
	"weLoveYouIf": {
		"title": "Dudes with these don't think twice",
		"descriptionHtml": "<ul>\r\n                    <li>If you can think in Images just say that at the top coz we gonna cut that line short for you and roll u the red carpet.</li>\r\n                    <li>Will help if you are a great photographer or have a girlfriend/boyfriend who is one :). You get the drift?</li>\r\n                    <li>You are crazy about these slick javascript frameworks</li>\r\n                    <li>We will really have tears in our eyes if you tell us that you have experience on UX.</li>\r\n                    <li>Experience working with a team of developers to convert design into a working application</li>\r\n                    <li>You love the movie inception, counterfeiters, Cars, Gulaal, Dev D, Godfather, Avatar</li>\r\n                    <li>You have at least on Rainbow tshirt.</li>\r\n                </ul>"
	},
	"images": [],
	"created_at": "2013-11-14T06:35:49.535Z",
	"updated_at": "2013-11-14T06:35:49.535Z",
	"_id": "52846f458580595205000004"
}