{
	"meta": {
		"title": "Web Developer",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email"
	},
	"facebook": {
		"title": "Web Developer at Vgulp",
		"description": "Do you believe that we are the right guys to work for? Don't have a degree ! We dont care a d**mn. Shoot us an email",
		"imageUrl": "http://www.vgulp.com/careers/ninja-designer.jpg",
		"pageUrl": "http://www.vgulp.com/careers/web-developer.html"
	},
	"module": {
		"name": "careers/web-developer",
		"slug": "careers/web-developer.html"
	},
	"template": "www/js/app/careers/views/careersPage.html",
	"showAgeGate": "false",
	"numberOfOpenPositions": "1",
	"location": "Bangalore",
	"introductionHtml": "  <p>We were launched in June 2013, and received funding in August. We are addressing a no brainer idea in a 35 Bn USD market in India, that had little takers for. Vgulp solves a simple problem - helping drinkers (like us, you?) find the best deals and discounts in the most happening joints in town. Through this we improve walk-ins and help merchants meet their business objectives.</p>\r\n                    <br>\r\n                    <p>Being a Web Developer for Vgulp, you are expected to be a finisher. We will together build features for the vgulp product that we dream about. Each and every one of us will own the \"Vgulp product\" and hack with one another over previously agreed timings. Oh does that involve office timings , <b class=\"lead\">heck no</b> bring your laptop! All our engineers are in live google hangout sessions. Enjoy a beer while you code @home if that pleases you. We all are seekers for imagination :) !</p>\r\n                    <br>\r\n                    <p>While we are not particular about you having a degree / years into your resume, we are people passionate about technology and believe in early adoptions. This has many a times honestly drove us against the wall, but heck we have come back stronger and more convinced. We believe in technology and programming being fun and \"delivery\" a necessary side effect. So all you hackers, philosophers, dreamers if you wanna risk something for the love of \"what you believed in\", Vgulp is calling!</p>\r\n",
	"skills": {
		"title": "What we think you should have",
		"descriptionHtml": "<ul>\r\n                        <li>Strong Object oriented programming skills</li>\r\n                        <li>Preference for working in a really fast paced environment</li>\r\n                        <li>Some projects on Groovy and Grails. If you can point us to a github or a bitbucket repository AWESOME!</li>\r\n                        <li>Abilities to work with a relational database like PostgresQL, MySQL, Oracle any your choice</li>\r\n                        <li>You are a Mongo Hero or a Neo4j King just ask for the offer directly :) </li>\r\n                    </ul>"
	},
	"otherPositions": [
		"<a href='./web-graphic-designer.html'>Web Graphic Designer</a>",
		"<a href=\"./javascript-ninja.html\">Javascript Ninja</a>"
	],
	"weLoveYouIf": {
		"title": "Dudes with these don't think twice",
		"descriptionHtml": "<ul>\r\n                    <li>Have an application running with AWS or EC2</li>\r\n                    <li>Tomcat is your little toy, you can break it and make it</li>\r\n                    <li>You are one of the programmers behind one of those web apps that kind of takes on a truck load of users and have gone home every day.</li>\r\n                    <li>You have experience with Hadoop, Faunus or any big data analytics framework</li>\r\n                    <li>You are an ardent fan of Rod Johnson, Martin Fowler, Kent Beck, Erich Gamma in no specific order.</li>\r\n                    <li>You love the movie inception, counterfeiters, Cars, Gulaal, Dev D, Godfather, Avatar</li>\r\n                    <li>Loves Property Graphs</li>\r\n                    <li>There is no place like 127.0.0.1</li>\r\n                </ul>"
	},
	"images": [],
	"created_at": "2013-11-14T06:18:57.599Z",
	"updated_at": "2013-11-14T06:18:57.599Z",
	"_id": "52846b518580595205000003"
}